dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGeth_reg.h
/** \brief D0, MAC LPI Control and Status Register */
#define GETH1_MAC_LPI_CONTROL_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_LPI_CONTROL_STATUS*)0xF00190D0u)

/** \brief D4, MAC LPI Timers Control Register */
#define GETH1_MAC_LPI_TIMERS_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_LPI_TIMERS_CONTROL*)0xF00190D4u)

/** \brief D8, MAC LPI Entry Timer Register */
#define GETH1_MAC_LPI_ENTRY_TIMER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_LPI_ENTRY_TIMER*)0xF00190D8u)

/** \brief DC, MAC One Microsecond Tic Counter Register */
#define GETH1_MAC_1US_TIC_COUNTER /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_1US_TIC_COUNTER*)0xF00190DCu)

/** \brief F8, MAC PHY Interface Control and Status Register */
#define GETH1_MAC_PHYIF_CONTROL_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_PHYIF_CONTROL_STATUS*)0xF00190F8u)

/** \brief 110, MAC Version Register */
#define GETH1_MAC_VERSION /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_VERSION*)0xF0019110u)

/** \brief 114, MAC Debug Register */
#define GETH1_MAC_DEBUG /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_DEBUG*)0xF0019114u)

/** \brief 11C, MAC Hardware Feature Register 0 */
#define GETH1_MAC_HW_FEATURE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_HW_FEATURE0*)0xF001911Cu)

/** \brief 120, MAC Hardware Feature Register 1 */
#define GETH1_MAC_HW_FEATURE1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_HW_FEATURE1*)0xF0019120u)

/** \brief 124, MAC Hardware Feature Register 2 */
#define GETH1_MAC_HW_FEATURE2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_HW_FEATURE2*)0xF0019124u)

/** \brief 128, MAC Hardware Feature Register 3 */
#define GETH1_MAC_HW_FEATURE3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_HW_FEATURE3*)0xF0019128u)

/** \brief 200, MAC MDIO Address Register */
#define GETH1_MAC_MDIO_ADDRESS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_MDIO_ADDRESS*)0xF0019200u)

/** \brief 204, MAC MDIO Data Register */
#define GETH1_MAC_MDIO_DATA /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_MDIO_DATA*)0xF0019204u)

/** \brief 230, MAC CSR Software Controls Register */
#define GETH1_MAC_CSR_SW_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_CSR_SW_CTRL*)0xF0019230u)

/** \brief 238, MAC Extended Configuration Register 1 */
#define GETH1_MAC_EXT_CFG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_EXT_CFG1*)0xF0019238u)

/** \brief 300, MAC Address 0 High Register */
#define GETH1_MAC_ADDRESS_HIGH0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH0*)0xF0019300u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH0.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH0.
*/
#define GETH1_MAC_ADDRESS0_HIGH (GETH1_MAC_ADDRESS_HIGH0)

/** \brief 304, MAC Address 0 Low Register */
#define GETH1_MAC_ADDRESS_LOW0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW0*)0xF0019304u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW0.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW0.
*/
#define GETH1_MAC_ADDRESS0_LOW (GETH1_MAC_ADDRESS_LOW0)

/** \brief 308, MAC Address 1 High Register */
#define GETH1_MAC_ADDRESS_HIGH1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019308u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH1.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH1.
*/
#define GETH1_MAC_ADDRESS1_HIGH (GETH1_MAC_ADDRESS_HIGH1)

/** \brief 30C, MAC Address 1 Low Register */
#define GETH1_MAC_ADDRESS_LOW1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001930Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW1.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW1.
*/
#define GETH1_MAC_ADDRESS1_LOW (GETH1_MAC_ADDRESS_LOW1)

/** \brief 310, MAC Address 2 High Register */
#define GETH1_MAC_ADDRESS_HIGH2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019310u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH2.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH2.
*/
#define GETH1_MAC_ADDRESS2_HIGH (GETH1_MAC_ADDRESS_HIGH2)

/** \brief 314, MAC Address 2 Low Register */
#define GETH1_MAC_ADDRESS_LOW2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF0019314u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW2.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW2.
*/
#define GETH1_MAC_ADDRESS2_LOW (GETH1_MAC_ADDRESS_LOW2)

/** \brief 318, MAC Address 3 High Register */
#define GETH1_MAC_ADDRESS_HIGH3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019318u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH3.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH3.
*/
#define GETH1_MAC_ADDRESS3_HIGH (GETH1_MAC_ADDRESS_HIGH3)

/** \brief 31C, MAC Address 3 Low Register */
#define GETH1_MAC_ADDRESS_LOW3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001931Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW3.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW3.
*/
#define GETH1_MAC_ADDRESS3_LOW (GETH1_MAC_ADDRESS_LOW3)

/** \brief 320, MAC Address 4 High Register */
#define GETH1_MAC_ADDRESS_HIGH4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019320u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH4.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH4.
*/
#define GETH1_MAC_ADDRESS4_HIGH (GETH1_MAC_ADDRESS_HIGH4)

/** \brief 324, MAC Address 4 Low Register */
#define GETH1_MAC_ADDRESS_LOW4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF0019324u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW4.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW4.
*/
#define GETH1_MAC_ADDRESS4_LOW (GETH1_MAC_ADDRESS_LOW4)

/** \brief 328, MAC Address 5 High Register */
#define GETH1_MAC_ADDRESS_HIGH5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019328u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH5.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH5.
*/
#define GETH1_MAC_ADDRESS5_HIGH (GETH1_MAC_ADDRESS_HIGH5)

/** \brief 32C, MAC Address 5 Low Register */
#define GETH1_MAC_ADDRESS_LOW5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001932Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW5.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW5.
*/
#define GETH1_MAC_ADDRESS5_LOW (GETH1_MAC_ADDRESS_LOW5)

