dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGeth_reg.h
/** \brief 330, MAC Address 6 High Register */
#define GETH1_MAC_ADDRESS_HIGH6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019330u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH6.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH6.
*/
#define GETH1_MAC_ADDRESS6_HIGH (GETH1_MAC_ADDRESS_HIGH6)

/** \brief 334, MAC Address 6 Low Register */
#define GETH1_MAC_ADDRESS_LOW6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF0019334u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW6.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW6.
*/
#define GETH1_MAC_ADDRESS6_LOW (GETH1_MAC_ADDRESS_LOW6)

/** \brief 338, MAC Address 7 High Register */
#define GETH1_MAC_ADDRESS_HIGH7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019338u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH7.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH7.
*/
#define GETH1_MAC_ADDRESS7_HIGH (GETH1_MAC_ADDRESS_HIGH7)

/** \brief 33C, MAC Address 7 Low Register */
#define GETH1_MAC_ADDRESS_LOW7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001933Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW7.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW7.
*/
#define GETH1_MAC_ADDRESS7_LOW (GETH1_MAC_ADDRESS_LOW7)

/** \brief 340, MAC Address 8 High Register */
#define GETH1_MAC_ADDRESS_HIGH8 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019340u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH8.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH8.
*/
#define GETH1_MAC_ADDRESS8_HIGH (GETH1_MAC_ADDRESS_HIGH8)

/** \brief 344, MAC Address 8 Low Register */
#define GETH1_MAC_ADDRESS_LOW8 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF0019344u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW8.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW8.
*/
#define GETH1_MAC_ADDRESS8_LOW (GETH1_MAC_ADDRESS_LOW8)

/** \brief 348, MAC Address 9 High Register */
#define GETH1_MAC_ADDRESS_HIGH9 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019348u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH9.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH9.
*/
#define GETH1_MAC_ADDRESS9_HIGH (GETH1_MAC_ADDRESS_HIGH9)

/** \brief 34C, MAC Address 9 Low Register */
#define GETH1_MAC_ADDRESS_LOW9 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001934Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW9.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW9.
*/
#define GETH1_MAC_ADDRESS9_LOW (GETH1_MAC_ADDRESS_LOW9)

/** \brief 350, MAC Address 10 High Register */
#define GETH1_MAC_ADDRESS_HIGH10 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019350u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH10.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH10.
*/
#define GETH1_MAC_ADDRESS10_HIGH (GETH1_MAC_ADDRESS_HIGH10)

/** \brief 354, MAC Address 10 Low Register */
#define GETH1_MAC_ADDRESS_LOW10 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF0019354u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW10.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW10.
*/
#define GETH1_MAC_ADDRESS10_LOW (GETH1_MAC_ADDRESS_LOW10)

/** \brief 358, MAC Address 11 High Register */
#define GETH1_MAC_ADDRESS_HIGH11 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019358u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH11.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH11.
*/
#define GETH1_MAC_ADDRESS11_HIGH (GETH1_MAC_ADDRESS_HIGH11)

/** \brief 35C, MAC Address 11 Low Register */
#define GETH1_MAC_ADDRESS_LOW11 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001935Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW11.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW11.
*/
#define GETH1_MAC_ADDRESS11_LOW (GETH1_MAC_ADDRESS_LOW11)

/** \brief 360, MAC Address 12 High Register */
#define GETH1_MAC_ADDRESS_HIGH12 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019360u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH12.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH12.
*/
#define GETH1_MAC_ADDRESS12_HIGH (GETH1_MAC_ADDRESS_HIGH12)

/** \brief 364, MAC Address 12 Low Register */
#define GETH1_MAC_ADDRESS_LOW12 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF0019364u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW12.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW12.
*/
#define GETH1_MAC_ADDRESS12_LOW (GETH1_MAC_ADDRESS_LOW12)

/** \brief 368, MAC Address 13 High Register */
#define GETH1_MAC_ADDRESS_HIGH13 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019368u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH13.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH13.
*/
#define GETH1_MAC_ADDRESS13_HIGH (GETH1_MAC_ADDRESS_HIGH13)

/** \brief 36C, MAC Address 13 Low Register */
#define GETH1_MAC_ADDRESS_LOW13 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF001936Cu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW13.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW13.
*/
#define GETH1_MAC_ADDRESS13_LOW (GETH1_MAC_ADDRESS_LOW13)

/** \brief 370, MAC Address 14 High Register */
#define GETH1_MAC_ADDRESS_HIGH14 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF0019370u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH14.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH14.
*/
#define GETH1_MAC_ADDRESS14_HIGH (GETH1_MAC_ADDRESS_HIGH14)

/** \brief 374, MAC Address 14 Low Register */
#define GETH1_MAC_ADDRESS_LOW14 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF0019374u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW14.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW14.
*/
#define GETH1_MAC_ADDRESS14_LOW (GETH1_MAC_ADDRESS_LOW14)

