dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGeth_reg.h
/** \brief 3BC, MAC Address 23 Low Register */
#define GETH1_MAC_ADDRESS_LOW23 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193BCu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW23.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW23.
*/
#define GETH1_MAC_ADDRESS23_LOW (GETH1_MAC_ADDRESS_LOW23)

/** \brief 3C0, MAC Address 24 High Register */
#define GETH1_MAC_ADDRESS_HIGH24 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193C0u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH24.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH24.
*/
#define GETH1_MAC_ADDRESS24_HIGH (GETH1_MAC_ADDRESS_HIGH24)

/** \brief 3C4, MAC Address 24 Low Register */
#define GETH1_MAC_ADDRESS_LOW24 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193C4u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW24.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW24.
*/
#define GETH1_MAC_ADDRESS24_LOW (GETH1_MAC_ADDRESS_LOW24)

/** \brief 3C8, MAC Address 25 High Register */
#define GETH1_MAC_ADDRESS_HIGH25 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193C8u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH25.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH25.
*/
#define GETH1_MAC_ADDRESS25_HIGH (GETH1_MAC_ADDRESS_HIGH25)

/** \brief 3CC, MAC Address 25 Low Register */
#define GETH1_MAC_ADDRESS_LOW25 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193CCu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW25.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW25.
*/
#define GETH1_MAC_ADDRESS25_LOW (GETH1_MAC_ADDRESS_LOW25)

/** \brief 3D0, MAC Address 26 High Register */
#define GETH1_MAC_ADDRESS_HIGH26 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193D0u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH26.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH26.
*/
#define GETH1_MAC_ADDRESS26_HIGH (GETH1_MAC_ADDRESS_HIGH26)

/** \brief 3D4, MAC Address 26 Low Register */
#define GETH1_MAC_ADDRESS_LOW26 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193D4u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW26.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW26.
*/
#define GETH1_MAC_ADDRESS26_LOW (GETH1_MAC_ADDRESS_LOW26)

/** \brief 3D8, MAC Address 27 High Register */
#define GETH1_MAC_ADDRESS_HIGH27 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193D8u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH27.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH27.
*/
#define GETH1_MAC_ADDRESS27_HIGH (GETH1_MAC_ADDRESS_HIGH27)

/** \brief 3DC, MAC Address 27 Low Register */
#define GETH1_MAC_ADDRESS_LOW27 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193DCu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW27.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW27.
*/
#define GETH1_MAC_ADDRESS27_LOW (GETH1_MAC_ADDRESS_LOW27)

/** \brief 3E0, MAC Address 28 High Register */
#define GETH1_MAC_ADDRESS_HIGH28 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193E0u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH28.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH28.
*/
#define GETH1_MAC_ADDRESS28_HIGH (GETH1_MAC_ADDRESS_HIGH28)

/** \brief 3E4, MAC Address 28 Low Register */
#define GETH1_MAC_ADDRESS_LOW28 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193E4u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW28.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW28.
*/
#define GETH1_MAC_ADDRESS28_LOW (GETH1_MAC_ADDRESS_LOW28)

/** \brief 3E8, MAC Address 29 High Register */
#define GETH1_MAC_ADDRESS_HIGH29 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193E8u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH29.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH29.
*/
#define GETH1_MAC_ADDRESS29_HIGH (GETH1_MAC_ADDRESS_HIGH29)

/** \brief 3EC, MAC Address 29 Low Register */
#define GETH1_MAC_ADDRESS_LOW29 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193ECu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW29.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW29.
*/
#define GETH1_MAC_ADDRESS29_LOW (GETH1_MAC_ADDRESS_LOW29)

/** \brief 3F0, MAC Address 30 High Register */
#define GETH1_MAC_ADDRESS_HIGH30 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193F0u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH30.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH30.
*/
#define GETH1_MAC_ADDRESS30_HIGH (GETH1_MAC_ADDRESS_HIGH30)

/** \brief 3F4, MAC Address 30 Low Register */
#define GETH1_MAC_ADDRESS_LOW30 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193F4u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW30.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW30.
*/
#define GETH1_MAC_ADDRESS30_LOW (GETH1_MAC_ADDRESS_LOW30)

/** \brief 3F8, MAC Address 31 High Register */
#define GETH1_MAC_ADDRESS_HIGH31 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_HIGH*)0xF00193F8u)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_HIGH31.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_HIGH31.
*/
#define GETH1_MAC_ADDRESS31_HIGH (GETH1_MAC_ADDRESS_HIGH31)

/** \brief 3FC, MAC Address 31 Low Register */
#define GETH1_MAC_ADDRESS_LOW31 /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_ADDRESS_LOW*)0xF00193FCu)
/** Alias (User Manual Name) for GETH1_MAC_ADDRESS_LOW31.
* To use register names with standard convension, please use GETH1_MAC_ADDRESS_LOW31.
*/
#define GETH1_MAC_ADDRESS31_LOW (GETH1_MAC_ADDRESS_LOW31)

/** \brief 700, MMC Control Register */
#define GETH1_MMC_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MMC_CONTROL*)0xF0019700u)

