dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxGeth_reg.h
/** \brief 838, Good Received TCP Packets Count Register */
#define GETH1_RXTCP_GOOD_PACKETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXTCP_GOOD_PACKETS*)0xF0019838u)

/** \brief 83C, Received TCP Error Packets Count Register */
#define GETH1_RXTCP_ERROR_PACKETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXTCP_ERROR_PACKETS*)0xF001983Cu)

/** \brief 840, Good Received ICMP Packets Count Register */
#define GETH1_RXICMP_GOOD_PACKETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXICMP_GOOD_PACKETS*)0xF0019840u)

/** \brief 844, Received ICMP Error Packets Count Register */
#define GETH1_RXICMP_ERROR_PACKETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXICMP_ERROR_PACKETS*)0xF0019844u)

/** \brief 850, Good Received IPV4 Octets Count Register */
#define GETH1_RXIPV4_GOOD_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXIPV4_GOOD_OCTETS*)0xF0019850u)

/** \brief 854, Received IPV4 Header Error Octets Count Register */
#define GETH1_RXIPV4_HEADER_ERROR_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXIPV4_HEADER_ERROR_OCTETS*)0xF0019854u)

/** \brief 858, Received IPV4 No Payload Octets Count Register */
#define GETH1_RXIPV4_NO_PAYLOAD_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXIPV4_NO_PAYLOAD_OCTETS*)0xF0019858u)

/** \brief 85C, Received IPV4 Fragmented Octets Count Register */
#define GETH1_RXIPV4_FRAGMENTED_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXIPV4_FRAGMENTED_OCTETS*)0xF001985Cu)

/** \brief 860, Received IPV4 UPD Checksum Disabled Octets Count Register */
#define GETH1_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS*)0xF0019860u)

/** \brief 864, Good Received IPV6 Octets Count Register */
#define GETH1_RXIPV6_GOOD_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXIPV6_GOOD_OCTETS*)0xF0019864u)

/** \brief 868, Received IPV6 Header Error Octets Count Register */
#define GETH1_RXIPV6_HEADER_ERROR_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXIPV6_HEADER_ERROR_OCTETS*)0xF0019868u)

/** \brief 86C, Received IPV6 No Payload Octets Count Register */
#define GETH1_RXIPV6_NO_PAYLOAD_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXIPV6_NO_PAYLOAD_OCTETS*)0xF001986Cu)

/** \brief 870, Good Received UDP Octets Count Register */
#define GETH1_RXUDP_GOOD_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXUDP_GOOD_OCTETS*)0xF0019870u)

/** \brief 874, Received UDP Error Octets Count Register */
#define GETH1_RXUDP_ERROR_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXUDP_ERROR_OCTETS*)0xF0019874u)

/** \brief 878, Good Received TCP Octets Count Register */
#define GETH1_RXTCP_GOOD_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXTCP_GOOD_OCTETS*)0xF0019878u)

/** \brief 87C, Received TCP Error Octets Count Register */
#define GETH1_RXTCP_ERROR_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXTCP_ERROR_OCTETS*)0xF001987Cu)

/** \brief 880, Good Received ICMP Octets Count Register */
#define GETH1_RXICMP_GOOD_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXICMP_GOOD_OCTETS*)0xF0019880u)

/** \brief 884, Received ICMP Error Octets Count Register */
#define GETH1_RXICMP_ERROR_OCTETS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_RXICMP_ERROR_OCTETS*)0xF0019884u)

/** \brief B00, MAC Timestamp Control Register */
#define GETH1_MAC_TIMESTAMP_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TIMESTAMP_CONTROL*)0xF0019B00u)

/** \brief B04, MAC Sub-Second Increment Register */
#define GETH1_MAC_SUB_SECOND_INCREMENT /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_SUB_SECOND_INCREMENT*)0xF0019B04u)

/** \brief B08, MAC System Time Seconds Register */
#define GETH1_MAC_SYSTEM_TIME_SECONDS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_SYSTEM_TIME_SECONDS*)0xF0019B08u)

/** \brief B0C, MAC System Time Nanoseconds Register */
#define GETH1_MAC_SYSTEM_TIME_NANOSECONDS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS*)0xF0019B0Cu)

/** \brief B10, MAC System Time Seconds Update Register */
#define GETH1_MAC_SYSTEM_TIME_SECONDS_UPDATE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_SYSTEM_TIME_SECONDS_UPDATE*)0xF0019B10u)

/** \brief B14, MAC System Time Nanoseconds Update Register */
#define GETH1_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE*)0xF0019B14u)

/** \brief B18, MAC Timestamp Addend Register */
#define GETH1_MAC_TIMESTAMP_ADDEND /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TIMESTAMP_ADDEND*)0xF0019B18u)

/** \brief B1C, MAC System Time Higher Word Seconds Register */
#define GETH1_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS*)0xF0019B1Cu)

/** \brief B20, MAC Timestamp Status Register */
#define GETH1_MAC_TIMESTAMP_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TIMESTAMP_STATUS*)0xF0019B20u)

/** \brief B30, MAC Transmit Timestamp Nanoseconds Status Register */
#define GETH1_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS*)0xF0019B30u)

/** \brief B34, MAC Transmit Timestamp Seconds Status Register */
#define GETH1_MAC_TX_TIMESTAMP_STATUS_SECONDS /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TX_TIMESTAMP_STATUS_SECONDS*)0xF0019B34u)

/** \brief B50, MAC Timestamp Ingress Asymmetry Correction Register */
#define GETH1_MAC_TIMESTAMP_INGRESS_ASYM_CORR /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TIMESTAMP_INGRESS_ASYM_CORR*)0xF0019B50u)

/** \brief B54, MAC Timestamp Egress Asymmetry Correction Register */
#define GETH1_MAC_TIMESTAMP_EGRESS_ASYM_CORR /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TIMESTAMP_EGRESS_ASYM_CORR*)0xF0019B54u)

/** \brief B58, MAC Timestamp Ingress Correction Nanoseconds Register */
#define GETH1_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND*)0xF0019B58u)

/** \brief B5C, MAC Timestamp Egress Correction Nanoseconds Register */
#define GETH1_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND*)0xF0019B5Cu)

/** \brief B60, MAC Timestamp Ingress Correction Subnanoseconds Register */
#define GETH1_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC*)0xF0019B60u)

/** \brief B64, MAC Timestamp Egress Correction Subnanoseconds Register */
#define GETH1_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC*)0xF0019B64u)

/** \brief B70, MAC PPS Control Register */
#define GETH1_MAC_PPS_CONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_GETH_MAC_PPS_CONTROL*)0xF0019B70u)

